package com.example.markshandler.Helper;


public class DoctorData {

    public static String [] DoctorName = {"محمد سيد عبدالعظيم","محي الدين علامى","وسام كمال","فاطمه عبده","عطا الألفي","إبراهيم إبراهيم أحمد","احمد عبدالقدير","الهلالي الشربيني","حنان الرفاعي","سها شعيب","مروة حسين","إيمان عبدالعظيم العياط","إبراهيم إبراهيم أحمد","أماني فوزي الجمل","أماني عبدالعزيز","منى عصمت","مروة الششتاوي","رانيا عدلي","شيماء خاطر","أحمد عبدالبديع","أماني غبور","محمد فوزي","محي الدين إسماعيل","نبيل عبدالمحسن","عبدالله جاد","حنان رزق","عاصم البحيري","احمد البيهي","حسنية محمد","أحمد أمين","إيمان عبدالقادر"};
    public static String [] DoctorID = {"1001","1002","1003","1004","1005","1006","1007","1008","1009","1010","1011","1012","1013","1014","1015","1016","1017","1018","1019","1020","1021","1022","1023","1024","1025","1026","1027","1028","1029","1030"};
    public static String [] D1001={"مقدمة في الحاسبات"};
    public static String [] D1002={"مبادئ رياضة"};
    public static String [] D1003={"مبادئ إحصاء","الإحصاء و الحاسب"};
    public static String [] D1004={"لغة إانجليوية(1)","لغة إنجليزية(2)","لغة إنجليزية و تطبيقاته(1)","لغة انجليزية و تطبيقاته(2)","مبادئ تدريس"};
    public static String [] D1005={"نظم تشغيل الحاسبات(1)","نظم تشغيل الحاسبات(2)","الذكاء الإصطناعي","النظم الخبيرة"};
    public static String [] D1006={"دراسات بيئية","مبادئ علم النفس","علاقات أسرية"};
    public static String [] D1007={"لغة عربية و تطبيقاتها"};
    public static String [] D1008={"أصول تربية","أصول تربية","الأصول الإجتماعية للتربية","الأصول الفلسفية للتربية"};
    public static String [] D1009={"قواعد بيانات","طرق تخطيط البرامج"};
    public static String [] D1010={"رياضيات حاسب"};
    public static String [] D1011={"مقدمة في البرمجة","تكنولوجيا المعلومات"};
    public static String [] D1012={"مقدمة في النوافذ"};
    public static String [] D1013={"برمجة(1)","البرمجة الجاهزة(1)"};
    public static String [] D1014={"تحليل نظم"};
    public static String [] D1015={"معالجة النصوص","صيانة الحاسب الآلي","النظم المعاونة في إتخاذ القرار"};
    public static String [] D1016={"علم نفس النمو"};
    public static String [] D1017={"برمجة(2)"};
    public static String [] D1018={"تصميم نظم"};
    public static String [] D1019={"قواعد بيانات(2)","الوسائط المتععدة"};
    public static String [] D1020={"التربية و مشكلات المجتمع"};
    public static String [] D1021={"الوسائط التعليمية"};
    public static String [] D1022={"منظومة الحاسب الآلي","شبكات الحاسب الآلي","الشبكات العالمية"};
    public static String [] D1023={"الحاسب الآلي","أمن المعلومات"};
    public static String [] D1024={"علم النفس الإجتماعي","صحة نفسية و إرشاد"};
    public static String [] D1025={"تاريخ التربية و التعليم","تربية مقارنة"};
    public static String [] D1026={"طرق تدريس(1)","طرق تدريس(2)","المناهج"};
    public static String [] D1027={"علم نفس تعليمي(1)","علم نفس تعليمي(2)"};
    public static String [] D1028={"تطبيقات الحاسب الآلي(1)","تطبيقات الحاسب الآلي(2)"};
    public static String [] D1029={"البرمجة الجاهزة(2)","البرمجة الشيئية الهيكلية"};
    public static String [] D1030={"إستخدام الجداول الإلكترونية"};

}
